In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,
'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

**Filtering Out Missing Data**

In [5]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data = pd.DataFrame(
    {'A': [5,8,9,np.nan],
    'B': ['Cat', np.nan, 'Dog', np.nan],
    'C': [np.nan, 2.5, 2.5, np.nan],
    'D': [10, 5, np.nan, np.nan]}
)
data

     A    B    C     D
0  5.0  Cat  NaN  10.0
1  8.0  NaN  2.5   5.0
2  9.0  Dog  2.5   NaN
3  NaN  NaN  NaN   NaN

In [13]:
data.fillna(method = 'ffill')

C:\Users\PC\AppData\Local\Temp\ipykernel_18364\3794184318.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = 'ffill')

     A    B    C     D
0  5.0  Cat  NaN  10.0
1  8.0  Cat  2.5   5.0
2  9.0  Dog  2.5   5.0
3  9.0  Dog  2.5   5.0

In [14]:
data.fillna(method = 'bfill')

C:\Users\PC\AppData\Local\Temp\ipykernel_18364\3058535179.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = 'bfill')

     A    B    C     D
0  5.0  Cat  2.5  10.0
1  8.0  Dog  2.5   5.0
2  9.0  Dog  2.5   NaN
3  NaN  NaN  NaN   NaN

In [15]:
# data['A'].fillna({data['A']: data['A'].mean()}, inplace = True)
# data['B'].fillna({np.nan: 'unknown'}, inplace = True)
# data['C'].fillna({data['C']: data['C'].median()}, inplace = True)
# data

In [18]:
data["A"] = data['A'].fillna(data['A'].mean())
data['B'] = data['B'].fillna('unknown')
data['C'] = data['C'].fillna(data['C'].median())
data

          A        B    C     D
0  5.000000      Cat  2.5  10.0
1  8.000000  unknown  2.5   5.0
2  9.000000      Dog  2.5   NaN
3  7.333333  unknown  2.5   NaN

In [38]:
ranges = pd.DataFrame(np.random.randn(2000, 15000))
ranges.head()

,0,1,2,3,4,5,6,7,8,9,...,14990,14991,14992,14993,14994,14995,14996,14997,14998,14999
0,1.339207,0.362441,0.256333,-0.040745,0.348108,-1.298156,-1.706486,-0.185330,-1.062098,1.200660,...,0.171684,0.314011,-0.654361,0.483284,1.197274,-0.171129,0.493543,-0.514186,0.398829,-0.339861
1,0.011880,-1.061207,2.469514,0.819965,2.086389,1.292102,-1.467060,-0.829099,-0.824906,-0.869488,...,-0.389812,0.539724,-0.074925,1.461275,0.352982,0.667245,-0.835468,-0.065594,-0.762350,-1.768375
2,0.900251,0.278983,-2.232835,0.164246,-1.056440,-2.454083,0.941762,-1.598189,-0.457166,-0.357450,...,-0.144348,1.019690,1.440995,0.369848,-0.093037,-0.477643,1.710785,-0.506614,1.362377,-0.100313
3,0.438966,0.169876,0.122163,-0.234633,0.525267,-2.114017,-1.208459,-1.938366,1.851731,0.270247,...,0.128597,1.173007,-0.685355,-0.179840,-0.997226,-0.050032,1.086941,0.795643,0.503567,1.064273
4,0.178348,1.219086,-0.964819,1.518031,-0.307227,-1.298077,0.083503,1.523863,0.977263,0.437293,...,-0.353664,-0.293764,-1.028827,-0.075499,-0.467674,-0.333051,-1.025605,0.700809,-0.088023,0.230280

In [39]:
ranges.size

30000000

In [23]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [24]:
data. dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [25]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [28]:
data.dropna(how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [34]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [35]:
data.dropna(axis = 1, how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0